In [1]:
import pandas as pd

In [2]:
DATA_PATH = 'c:\\Users\\Public\\Documents\\Lesson_4.1\\names\\'

Функция загружает указанные года и выводит ТОП-3 популярных имен

In [3]:
def get_dataframe(years):
    data = dict()
    for year in years:
        year_path = pd.read_csv(DATA_PATH + 'yob{}.txt'.format(str(year)), names=['Name','Gender','Count'])
        data[str(year)] = year_path
    return data

In [4]:
def count_top3(years):
    data = get_dataframe(years)
    data_join = pd.concat(data).groupby('Name').sum()
    top = data_join.sort_values(by='Count', ascending=False)
    return top.head(3)

In [5]:
count_top3([1880])

         Count
Name
John      9701
William   9562
Mary      7092

In [6]:
count_top3([1900, 1950, 2000])

         Count
Name
James   111798
John    109593
Robert  101373

Динамика изменения количества имен за указанные года в разрезе полов

In [7]:
def count_dynamics(years):
    data = get_dataframe(years)
    resalt = pd.concat(data, names=['Year']).groupby(['Gender', 'Year']).sum()       
    return resalt

In [8]:
count_dynamics([1900, 1950, 2000])

               Count
Gender Year
F      1900   299800
       1950  1713151
       2000  1815110
M      1900   150483
       1950  1790549
       2000  1962969